# 😎😎😎while loop
# we can execute a set of statements as long as "a condition" is true.

# for i in range(100): print("နေကောင်းလား")  # for loop ကို သုံးပြီး "နေကောင်းလား" ဆိုတဲ့
# စာသားကို 100 ကြိမ်ထပ်ခါထပ်ခါ ရိုက်ထုတ်နိုင်ပါတယ်။
#     print("နေကောင်းလား")

count = 1  # count ဆိုတဲ့ variable ထဲကို စတင်ပြီး တန်ဖိုး 1 ထည့်လိုက်ပါတယ်။ 0 or 1 တန်ဖိုးကို စတင်ပြီး ထည့်သွင်းနိုင်ပါတယ်။
# count တန်ဖိုးသည် 6 ထက် ငယ်နေသမျှ ကာလပတ်လုံး (True ဖြစ်နေသမျှ) အောက်က ကုဒ်များကို ထပ်ခါထပ်ခါ လုပ်ဆောင်ပါမယ်။

while count < 6:
    print("မင်္ဂလာပါ", count)
    count += 1
# 😎😎
# "မင်္ဂလာပါ" ဆိုသည့် စာသားနှင့်အတူ လက်ရှိ count ရဲ့ တန်ဖိုး (၁၊ ၂၊ ၃...) ကို စခရင်ပေါ်မှာ ရိုက်ထုတ်ပြပါမယ်။
# Print ထုတ်ပြပြီးတိုင်း count တန်ဖိုးထဲကို 1 ထပ်ပေါင်းပါမယ်။ (count = count + 1 ဟု ရေးသည်နှင့် အတူတူပါပဲ)

# 😎Loop ရပ်တန့်သွားပုံ:
# count တန်ဖိုးသည် 1, 2, 3, 4, 5 အထိ 6 ထက် ငယ်သောကြောင့် ၅ ကြိမ်တိုင်တိုင် "မင်္ဂလာပါ" နှင့် နံပါတ်များကို ရိုက်ထုတ်ပါမည်။
# count တန်ဖိုး 6 ဖြစ်သွားချိန်တွင် count < 6 ဆိုသည့် အခြေအနေသည် မမှန်တော့ပါ (False ဖြစ်သွားပါမည်)။ ထို့ကြောင့် Loop သည်
# အလိုအလျောက် ရပ်တန့်သွားပါမည်။
# number = 100
# while number > 0:
#     print(number)
#     number = number // 2 ရပ်တန့်သွားစေတဲ့ သက်ရောက်မှု (Exit point) ကို ဖန်တီးပေးတာပါ။


# if break
count = 0
while count < 6:
    print("အဆင်ပြေလား", count)
    if count == 4:
        break
    count += 1


# if continue
count = 0
# count ဆိုတဲ့ ဗာရီရေးဘယ်လ်ကို စတင်ပြီး တန်ဖိုး 0 လို့ သတ်မှတ်လိုက်ပါတယ်

while count < 6:
    # count တန်ဖိုးဟာ 6 ထက် ငယ်နေသမျှ ကာလပတ်လုံး Loop ကို ပတ်နေမှာဖြစ်ပါတယ်

    count += 1
    # Loop တစ်ခါပတ်တိုင်း count တန်ဖိုးကို 1 တိုးပေးပါတယ် (0 ကနေ 1, 2, 3... စသည်ဖြင့် တိုးသွားပါမည်)

    if count == 4:
        continue
    # အဓိက သတိပြုရမည့်နေရာ - count တန်ဖိုး 4 နဲ့ ညီသွားတဲ့အခါ continue ကြောင့်
    # အောက်မှာရှိတဲ့ print() ကုဒ်ကို ဆက်အလုပ်မလုပ်တော့ဘဲ Loop ရဲ့ ထိပ်ဆုံးသို့ ချက်ချင်း ပြန်တက်သွားပါတယ်

    print("ကျန်းမာပါစေ", count)
    # count တန်ဖိုး 4 မဟုတ်တဲ့ အခါမျိုးမှာပဲ ဒီ Print လိုင်းကို ရောက်ပြီး စာရိုက်ထုတ်ပေမယ်
