# 😎😎😎while loop
# we can execute a set of statements as long as "a condition" is true.

# for i in range(100): print("နေကောင်းလား")  # for loop ကို သုံးပြီး "နေကောင်းလား" ဆိုတဲ့
# စာသားကို 100 ကြိမ်ထပ်ခါထပ်ခါ ရိုက်ထုတ်နိုင်ပါတယ်။
#     print("နေကောင်းလား")

count = 1  # count ဆိုတဲ့ variable ထဲကို စတင်ပြီး တန်ဖိုး 1 ထည့်လိုက်ပါတယ်။ 0 or 1 တန်ဖိုးကို စတင်ပြီး ထည့်သွင်းနိုင်ပါတယ်။
# count တန်ဖိုးသည် 6 ထက် ငယ်နေသမျှ ကာလပတ်လုံး (True ဖြစ်နေသမျှ) အောက်က ကုဒ်များကို ထပ်ခါထပ်ခါ လုပ်ဆောင်ပါမယ်။

while count < 6:
    print("နေကောင်းလား", count)
    count += 1
# 😎😎
# "နေကောင်းလား" ဆိုသည့် စာသားနှင့်အတူ လက်ရှိ count ရဲ့ တန်ဖိုး (၁၊ ၂၊ ၃...) ကို စခရင်ပေါ်မှာ ရိုက်ထုတ်ပြပါမယ်။
# ပရင့်ထုတ်ပြီးတိုင်း count တန်ဖိုးကို 1 တိုးပေးပါတယ်။ (count = count + 1 ဟု ရေးသည်နှင့် အတူတူဖြစ်သည်)

# 😎Loop ရပ်တန့်သွားပုံ:
# count တန်ဖိုးသည် 1, 2, 3, 4, 5 အထိ 6 ထက် ငယ်သောကြောင့် ၅ ကြိမ်တိုင်တိုင် "နေကောင်းလား" နှင့် နံပါတ်များကို ရိုက်ထုတ်ပါမည်။
# count တန်ဖိုး 6 ဖြစ်သွားချိန်တွင် count < 6 ဆိုသော အခြေအနေသည် မှားယွင်းသွားသည့်အတွက် (False) while loop အလုပ်လုပ်ခြင်း
# ရပ်တန့်သွားပါမည်။

# number = 100
# while number > 0:
#     print(number)
#     number = number // 2 ရပ်တန့်သွားစေတဲ့ သက်ရောက်မှု (Exit point) ကို ဖန်တီးပေးတာပါ။
